backend/controllers/ColecaoController.php

SELECT * FROM `colecao` WHERE `id`='14'
---
    protected function findModel($id)
    {
        if (($model = Colecao::findOne(['id' => $id])) !== null) {