common/models/User.php

SELECT * FROM `colecao` WHERE `user_id`=6
DELETE FROM `item` WHERE `colecao_id`=11
DELETE FROM `favorito` WHERE `colecao_id`=11
DELETE FROM `colecao` WHERE `id`=11
---
    public function beforeDelete()
    {
        if (!parent::beforeDelete()) {
            return false;
        }

        // Get all user collections
        $colecoes = Colecao::find()->where(['user_id' => $this->id])->all();

        foreach ($colecoes as $colecao) {
            // Delete all items in each collection
            Item::deleteAll(['colecao_id' => $colecao->id]);

            // Delete collection favorites
            ColecaoFavorito::deleteAll(['colecao_id' => $colecao->id]);

            // Delete the collection
            $colecao->delete();